# Решение задачи на C# для итоговой контрольнаой работы по основному блоку
## Сама задача 
Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
## Краткое описание решения
Для решения задачи используется дополнительный массив "resault", его индекс "n", цикл "for" и оператор "if" с условием, что длинна елемента исходного массива меньше или равна 3-ем символам. Если условие выполняется, то элемент записывается в новый массив, и увеличивается индекс "n".
```
int n = 0;
for (int i = 0; i < array.Length; i++)
{
    if(array[i].Length <= 3)
    {
        resault[n] = array[i];
        n = n + 1;
    }
}
```
## Используемые методы
### 1) Запроса числа
Используется для того, чтобы пользователь задал длинну массива, который будет вводить.
```
int GetNumber(string message)
{
    Console.Write($"Введите число {message}: ");
    int num = Convert.ToInt32(Console.ReadLine());
    return num;
}
```
### 2) Заполнение массива пользователем
Используется для того, чтобы пользователь сам мог вводить строки,которые хочет проверить.
```
void FillArrayFromUser(string[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"Введите {i} элемент массива: ");
        array[i] = Console.ReadLine()!;
    }
}
```
### 3) Вывод массива в консоль
```
void PrintArray(string[] array)
{
for (int i = 0; i < array.Length; i++)
{
    Console.Write($"{array[i]} ");
}  
}
```